Tekla Open API Reference for Tekla Structures 2025
BoltItem.ExportBoltStandard Method
 Exports the bolt item standard + needed bolt catalog items in *.bass-format to the to given file name. If path is not given bolt standard + items are exported to model folder. If filename is empty bolt standard name is used as filename.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ExportBoltStandard(
	ref string filename
)
Public Function ExportBoltStandard (
	ByRef filename As String
) As Boolean
Parameters
filename
Type: System.String
The export file name of the bolt assembly.
Return Value
Type: Boolean
True on success.
Examples
using System;
using Tekla.Structures.Catalogs;
public class Example
{
       public void Example1()
       {
           CatalogHandler catalogHandler = new CatalogHandler();
           if (catalogHandler.GetConnectionStatus())
           {
               BoltItemEnumerator boltItemEnumerator = CatalogHandler.GetBoltItems();
               while (boltItemEnumerator.MoveNext())
               {
                   BoltItem boltItem = boltItemEnumerator.Current as BoltItem;
                   if (boltItem.Standard == "A325N")
                   {
                       boltItem.ExportBoltStandard(System.IO.Path.GetTempPath() + "\\" + boltItem.Standard);
                       Result = true;
                       break;
                   }
               }
           }
       }
}
See Also
Reference
BoltItem Class
Tekla.Structures.Catalogs Namespace